# 1．相对路径是相对于什么？
当前目录
# 2．绝对路径从什么开始？
根目录开始
# 3．os.getcwd()和os.chdir()函数做什么事？
os.getcwd()获取当前目录的绝对路径，os.chdir()改变当前工作路径
# 4．.和..文件夹是什么？
.是当前目录文件夹路径，..是根目录路径
# 5．在C:\bacon\eggs\spam.txt 中，哪一部分是目录名称，哪一部分是基本名称？
"C:\bacon\eggs\"目录名称，"spam.txt"基本名称
# 6．可以传递给open()函数的3 种“模式”参数是什么？
'r'读取文本  'w'写入文本 'a'添加文本
# 7．如果已有的文件以写模式打开，会发生什么？
若写入文本，原来的的文本会被覆盖
# 8．read()和readlines()方法之间的区别是什么？
read()全部读取，输出一行的字符串，readlines()按行读取，输出一个字符串列表，其中每个字符串是文件内容中的一行。
# 9．shelf 值与什么数据结构相似？
shelf 值类似字典值，它有键和值，以及keys() 和values() 方法，类似于同名的字典方法。